/*
	作用域：
		1.类作用域：此术语是指一种称为类的数据类型
		2.局部作用域：在一个程序块中声明的标识符，其作用域由声明位置一直扩展到该程序块的末尾
		3.全局作用域：在所有函数和类的外部声明的标识符其作用域是从其声明位置知道代码文件最末尾

	名称优先级
		若一个函数声明的一个局部标识符与一个全局标识符同名，则该局部标识符在该函数中拥有优先权

	作用域规则：
			1.函数名拥有全局作用域。函数定义中不能嵌套函数定义
			2.函数参数的作用域与函数体最外层程序块中声明的局部变量相同
			3.全局变量或常量的作用域由其声明延伸到其声明所在块的末尾
			4.局部变量或常量的作用域由其声明位置延伸到其声明所在块的末尾
			5.若嵌套程序块中包含局部声明的同名标识符，则外部同名标识符的作用域将不包含这些嵌套块（局部标识符具有名字优先权）
	标识符的作用域：
				局部变量是在一个程序块（如函数体）内声明的变量

	命名空间：

	变量的生存期：
				1.作用域是编译时问题，而生存期是运行时的问题
				2.所有全局变量都是静态变量（静态变量的存储在整个程序的执行期间保持分配状态）
				3.在声明局部变量是可以使用保留字static，其生存期将一直保持

	接口设计：
			
*/